$(function() {
    clients = [{'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':3,'楼栋':1,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':1,'楼栋':1,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':3,'楼栋':3,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':4,'楼栋':3,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':5,'楼栋':3,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':7,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'楼栋':2,'单元号':'12918','业主':'小王','来访者':'张三','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''}
    ];
    var buidings = [
        {name:'',Id:0},
        {name:'1栋',Id:1},
        {name:'2栋',Id:2},
        {name:'3栋',Id:3},
        {name:'4栋',Id:4},
        {name:'5栋',Id:5},
        {name:'6栋',Id:6},
        {name:'7栋',Id:7},
        {name:'8栋',Id:8},
        {name:'9栋',Id:9},
        {name:'10栋',Id:10},
        {name:'11栋',Id:11},
        {name:'12栋',Id:12},
        {name:'13栋',Id:13},
        {name:'14栋',Id:14},
        {name:'15栋',Id:15},
        {name:'16栋',Id:16}
    ]
    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        // filtering: true,
        editing: true,
        // inserting: true,
        // sorting: true,
        paging: true,
        confirmDeleting: false,
        autoload: true,
        pageSize: 17,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name"},
            { name: "楼栋", type: "select", items: buidings, valueField: "Id", textField: "name"},
            { name: "单元号", type: "text", width: 100 },
            { name: "业主", type: "text", width: 100 },
            { name: "来访者", type: "text", width: 100 },
            { name: "授权时间", type: "text", width: 150 },
            { name: "有效期", type: "text", width: 150 },
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});