$(function() {
    clients = [{'管理处':1,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':2,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':3,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':3,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':3,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':3,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':4,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':4,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':5,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':6,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':7,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':7,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':2,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':2,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':3,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':3,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':1,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':1,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'},
        {'管理处':1,'合同编号':'12-580','合同名称':'住房交接合同','合同开始日期':'2017-01-10','合同结束日期':'2018-01-10','经手人':'小王','客户名称':'张三','联系电话':'5168121','备注':'','审核人':'小徐','制单时间':'2017-01-10'}
    ];
    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        autoload: true,
        pageSize: 15,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name" },
            { name: "合同编号", type: "text", width: 100 },
            { name: "合同名称", type: "text", width: 100 },
            { name: "合同开始日期", type: "text", width: 100 },
            { name: "合同结束日期", type: "text", width: 100 },
            { name: "经手人", type: "text", width: 80 },
            { name: "客户名称", type: "text", width: 80 },
            { name: "联系电话", type: "text", width: 100},
            { name: "备注", type: "text", sorting: true },
            { name: "审核人", type: "text", width: 100},
            { name: "制单时间", type: "text", width: 100},
            { type: "control" }
        ]
    });

});