$(function() {
    clients = [{'大门':19,'当前安全等级':1,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':2,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':3,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':4,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':5,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':6,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':7,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':8,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':9,'当前安全等级':4,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':10,'当前安全等级':4,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':11,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':12,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':13,'当前安全等级':3,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':14,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':15,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':16,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':17,'当前安全等级':2,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':18,'当前安全等级':1,'当前人流量':'128','值班人员':'小王','备注':''},
       {'大门':19,'当前安全等级':1,'当前人流量':'128','值班人员':'小王','备注':''}
    ];
    var damen = [
        {name:'',Id:0},
        {name:'1栋',Id:1},
        {name:'2栋',Id:2},
        {name:'3栋',Id:3},
        {name:'4栋',Id:4},
        {name:'5栋',Id:5},
        {name:'6栋',Id:6},
        {name:'7栋',Id:7},
        {name:'8栋',Id:8},
        {name:'9栋',Id:9},
        {name:'10栋',Id:10},
        {name:'11栋',Id:11},
        {name:'12栋',Id:12},
        {name:'13栋',Id:13},
        {name:'14栋',Id:14},
        {name:'15栋',Id:15},
        {name:'16栋',Id:16},
        {name:'东大门',Id:17},
        {name:'南大门',Id:18},
        {name:'西大门',Id:19},
        {name:'北大门',Id:20}
    ]
    var level = [
        {name:'',Id: 0 },
        {name:'弱',Id: 1 },
        {name:'较弱',Id: 2 },
        {name:'中等',Id: 3 },
        {name:'强',Id: 4 },
        {name:'最强',Id: 5 }
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        confirmDeleting: false,
        autoload: true,
        pageSize: 17,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "大门", type: "select", items: damen, valueField: "Id", textField: "name" },
            { name: "当前安全等级", type: "select", items: level, valueField: "Id", textField: "name" },
            { name: "当前人流量", type: "text", width: 100 },
            { name: "值班人员", type: "text", width: 100 },
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});