$(function() {
    clients = [{'管理处':1,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':1,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':2,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':2,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':2,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':3,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':3,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':4,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':4,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':2,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':5,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':5,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':6,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':6,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':7,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':7,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':7,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':1,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':1,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''},
        {'管理处':1,'文件流水号':'file-201712000048','文档名称':'秩序巡查记录','存档日期':'2017-12-20','页数':'4','文档类别':1,'录单人':'小张','录单日期':'2017-12-10','备注':''}
    ];
    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    var type = [
        {name:'',Id:0},
        {name:'合同文档',Id:1},
        {name:'服务文档',Id:2}
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        autoload: true,
        pageSize: 15,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name" },
            { name: "文件流水号", type: "text", width: 150 },
            { name: "文档名称", type: "text", width: 100 },
            { name: "存档日期", type: "text", width: 100 },
            { name: "页数", type: "text", width: 50 },
            { name: "文档类别", type: "select", items: type, valueField: "Id", textField: "name" },
            { name: "录单人", type: "text", width: 100 },
            { name: "录单日期", type: "text", width: 100},
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});