$(function() {
    var clients=[
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':1,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小张','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':2,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小李','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':2,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小赵','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':3,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小徐','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':3,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小吴','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':3,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小贝','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':4,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小史','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':4,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小明','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':1,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小美','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':5,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小倩','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':5,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小苏','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':6,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':3,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':3,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':2,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':6,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':1,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''},
        {'姓名':'小王','身份证号':'350122198506237125','联系方式':'15733651615','申请职位':1,'个人简介':'曾在**小区担任过助理，对该工作具有……','申请时间':'2017/01/12 19:00','备注':''}
    ];
    var career = [
        {name:'',id:0},
        {name:'保安',id:1},
        {name:'财务',id:2},
        {name:'行政',id:3},
        {name:'人事',id:4},
        {name:'环卫',id:5},
        {name:'维修',id:6}
    ]
            $("#jsGrid").jsGrid({
                height: "70%",
                width: "100%",
                sorting: true,
                paging: true,
                fields: [
                    { name: "姓名", type: "text", width: 50 },
                    { name: "身份证号", type: "text", width: 200 },
                    { name: "联系方式", type: "text", width:100 },
                    { name: "申请职位", type: "text",width:100 },
                    { name: "个人简介", type: "text",width:200 },
                    { name: "申请时间", type: "text",width:150 },
                    { name: "备注", type: "text",width:100 }
                ],
                data: clients
            });


            $(".jsgrid-grid-header .jsgrid-table .jsgrid-header-row").append("<th style='width:100px;'>answer</th>");
            $(".jsgrid-grid-body tr").each(function(){
                $(this).append("<td style='width:100px;'><label><button style='margin-left:15px;width:59px;' class='answer'>同意</button><button style='margin-left:15px;background-color:red;width:59px;height:26px;' class='delete'>拒绝</button></label></td>");
            });
            //拒绝
            $(".delete").click(function(){
                $(this).parent().parent().parent().remove();
                $.MsgBox.Alert("Tips","操作成功,已拒绝");
                //将删除掉的信息返回给服务器
                var msg=$(this).parent().parent().parent();
                var name=$(msg).children("td").eq(1).val();
                var Idnumber=$(msg).children("td").eq(2).val();
                var tel=$(msg).children("td").eq(3).val();
                var relationship=$(msg).children("td").eq(4).val();
                var ValidityTime=$(msg).children("td").eq(5).val();
                var result=false;
                // $.ajax({
                //     url:'',
                //     dataType:'JSON',
                //     type:'get',
                //     data:{
                //         msg:msg,
                //         name:name,
                //         Idnumber:Idnumber,
                //         tel:tel,
                //         relationship:relationship,
                //         ValidityTime:ValidityTime,
                //         result:result
                //     },
                //     success:function(data){
                //         console.log(data);
                //     },
                //     error:function(data){

                //     }
                // });
            });
            //同意
            $(".answer").click(function(){
                $(this).parent().parent().parent().remove();
                $.MsgBox.Alert("Tips","操作成功,已同意");
                //将删除掉的信息返回给服务器
                var msg=$(this).parent().parent().parent();
                var name=$(msg).children("td").eq(1).val();
                var Idnumber=$(msg).children("td").eq(2).val();
                var tel=$(msg).children("td").eq(3).val();
                var relationship=$(msg).children("td").eq(4).val();
                var ValidityTime=$(msg).children("td").eq(5).val();
                var result=true;
                // $.ajax({
                //     url:'',
                //     dataType:'JSON',
                //     type:'get',
                //     data:{
                //         msg:msg,
                //         name:name,
                //         Idnumber:Idnumber,
                //         tel:tel,
                //         relationship:relationship,
                //         ValidityTime:ValidityTime
                //         result:result
                //     },
                //     success:function(data){
                //         console.log(data);
                //     },
                //     error:function(data){

                //     }
                // });
            });
            //pass
        });