$(function() {
    clients = [{'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':1,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':2,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':2,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':2,'备注':''},
            {'管理处':2,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':2,'备注':''},
            {'管理处':3,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':3,'备注':''},
            {'管理处':3,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':3,'备注':''},
            {'管理处':3,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':3,'备注':''},
            {'管理处':4,'姓名':'小王','员工编号':'01-1-1-2','职位':4,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':3,'备注':''},
            {'管理处':2,'姓名':'小王','员工编号':'01-1-1-2','职位':4,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':4,'备注':''},
            {'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':4,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':4,'备注':''},
            {'管理处':4,'姓名':'小王','员工编号':'01-1-1-2','职位':4,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':4,'备注':''},
            {'管理处':5,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':6,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':6,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':7,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':7,'姓名':'小王','员工编号':'01-1-1-2','职位':2,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':3,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':1,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''},
            {'管理处':1,'姓名':'小王','员工编号':'01-1-1-2','职位':1,'联系方式':'15158008135','本月请假次数':'0','本月迟到次数':'0','今日到岗情况':1,'备注':''}   
    ];
    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    var career = [
        {name:'',Id:0},
        {name:'行政人事',Id:1},
        {name:'客服',Id:2},
        {name:'工程',Id:3},
        {name:'保安',Id:4}
    ]
    var situation = [
        {name:'',Id:0},
        {name:'到岗',Id:1},
        {name:'迟到',Id:2},
        {name:'请假',Id:3},
        {name:'缺席',Id:4}
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        autoload: true,
        pageSize: 15,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name" },
            { name: "姓名", type: "text", width:100 },
            { name: "员工编号", type: "text", width: 100 },
            { name: "职位", type: "select", items: career, valueField: "Id", textField: "name" },
            { name: "联系方式", type: "text", width: 100 },
            { name: "本月请假次数", type: "text", width: 100 },
            { name: "本月迟到次数", type: "text", width: 100 },
            { name: "今日到岗情况", type: "select", items: situation, valueField: "Id", textField: "name" },
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});