$(function() {
    clients = [{'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':3,'授权类型':1,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':1,'授权类型':1,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':3,'授权类型':3,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':4,'授权类型':3,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':5,'授权类型':3,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':7,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''},
        {'管理处':2,'授权类型':2,'操作者':'小王','授权时间':'2018-02-26 18:00','有效期':'2017/08/12/19:00--2018/12/12/19:00','备注':''}
    ];

    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    var type = [
        {name:'',Id:0},
        {name:'访客授权',Id:1},
        {name:'业主授权',Id:2},
        {name:'临时访客授权',Id:3}
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        // filtering: true,
        editing: true,
        // inserting: true,
        // sorting: true,
        paging: true,
        confirmDeleting: false,
        autoload: true,
        pageSize: 17,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name"},
            { name: "授权类型", type: "select", items: type, valueField: "Id", textField: "name"},
            { name: "操作者", type: "text", width: 100 },
            { name: "授权时间", type: "text", width: 200 },
            { name: "有效期", type: "text", width: 200 },
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});