$(function() {
    clients = [{'管理处':1,'楼宇':1,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'房屋类型':1,'入住日期':'2018-09-10','备注':''},
        {'管理处':2,'楼宇':3,'房间编号':'03-1-1-2','建筑面积':'125.00','客户名称':'小张','房屋状态':2,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':1,'楼宇':4,'房间编号':'04-1-1-2','建筑面积':'125.00','客户名称':'小李','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':3,'楼宇':2,'房间编号':'02-1-1-2','建筑面积':'125.00','客户名称':'小钱','房屋状态':4,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':4,'楼宇':8,'房间编号':'08-1-1-2','建筑面积':'125.00','客户名称':'小笋','房屋状态':4,'房屋类型':1,'入住日期':'2018-09-10','备注':''},
        {'管理处':1,'楼宇':5,'房间编号':'05-1-1-2','建筑面积':'125.00','客户名称':'小美','房屋状态':4,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':1,'楼宇':9,'房间编号':'09-1-1-2','建筑面积':'125.00','客户名称':'小吴','房屋状态':2,'房屋类型':1,'入住日期':'2018-09-10','备注':''},
        {'管理处':2,'楼宇':12,'房间编号':'12-1-1-2','建筑面积':'125.00','客户名称':'小时','房屋状态':3,'房屋类型':1,'入住日期':'2018-09-10','备注':''},
        {'管理处':2,'楼宇':15,'房间编号':'15-1-1-2','建筑面积':'125.00','客户名称':'小酒','房屋状态':1,'房屋类型':1,'入住日期':'2018-09-10','备注':''},
        {'管理处':4,'楼宇':2,'房间编号':'2-1-1-2','建筑面积':'125.00','客户名称':'小飞','房屋状态':1,'房屋类型':1,'入住日期':'2018-09-10','备注':''},
        {'管理处':5,'楼宇':6,'房间编号':'06-1-1-2','建筑面积':'125.00','客户名称':'小诗','房屋状态':2,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':7,'楼宇':9,'房间编号':'09-1-1-2','建筑面积':'125.00','客户名称':'小若','房屋状态':2,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':5,'楼宇':12,'房间编号':'12-1-1-2','建筑面积':'125.00','客户名称':'小吴','房屋状态':2,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':13,'房间编号':'13-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''},
        {'管理处':6,'楼宇':10,'房间编号':'10-1-1-2','建筑面积':'125.00','客户名称':'小图','房屋状态':1,'房屋类型':2,'入住日期':'2018-09-10','备注':''}
    ];
    var buidings = [
        {name:'',Id:0},
        {name:'1栋',Id:1},
        {name:'2栋',Id:2},
        {name:'3栋',Id:3},
        {name:'4栋',Id:4},
        {name:'5栋',Id:5},
        {name:'6栋',Id:6},
        {name:'7栋',Id:7},
        {name:'8栋',Id:8},
        {name:'9栋',Id:9},
        {name:'10栋',Id:10},
        {name:'11栋',Id:11},
        {name:'12栋',Id:12},
        {name:'13栋',Id:13},
        {name:'14栋',Id:14},
        {name:'15栋',Id:15},
        {name:'16栋',Id:16}
    ]
    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    var type = [
        {name:'',Id:0},
        {name:'商品房',Id:1},
        {name:'经济适用房',Id:2},
        {name:'共有房',Id:3},
        {name:'廉租房',Id:4}
    ]
    var leixing = [
        {name:'',Id:0},
        {name:'装修中',Id:1},
        {name:'已入住',Id:2}
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        autoload: true,
        pageSize: 15,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name" },
            { name: "楼宇", type: "select", items: buidings, valueField: "Id", textField: "name" },
            { name: "房间编号", type: "text", width: 100 },
            { name: "建筑面积", type: "text", width: 100 },
            { name: "客户名称", type: "text", width: 100 },
            { name: "房屋状态", type: "select", items: type, valueField: "Id", textField: "name" },
            { name: "房屋类型", type: "select", items: leixing, valueField: "Id", textField: "name" },
            { name: "入住日期", type: "text", width: 100},
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});