$(function() {
    clients = [{'楼宇':1,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':10,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':13,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':15,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':16,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':2,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':5,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':5,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':7,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':8,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':9,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':3,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':3,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':4,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':4,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':10,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':11,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':12,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':10,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':9,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':2,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''},
        {'楼宇':1,'房间编号':'01-1-1-2','建筑面积':'125.00','客户名称':'小王','房屋状态':1,'迁入日期':'2017-09-10','迁出日期':'2018-09-10','备注':''}
    ];
    var buidings = [
        {name:'',Id:0},
        {name:'1栋',Id:1},
        {name:'2栋',Id:2},
        {name:'3栋',Id:3},
        {name:'4栋',Id:4},
        {name:'5栋',Id:5},
        {name:'6栋',Id:6},
        {name:'7栋',Id:7},
        {name:'8栋',Id:8},
        {name:'9栋',Id:9},
        {name:'10栋',Id:10},
        {name:'11栋',Id:11},
        {name:'12栋',Id:12},
        {name:'13栋',Id:13},
        {name:'14栋',Id:14},
        {name:'15栋',Id:15},
        {name:'16栋',Id:16}
    ]
    var type = [
        {name:'',Id:0},
        {name:'商品房',Id:1},
        {name:'经济适用房',Id:2},
        {name:'共有房',Id:3},
        {name:'廉租房',Id:4}
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        autoload: true,
        pageSize: 15,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "楼宇", type: "select", items: buidings, valueField: "Id", textField: "name" },
            { name: "房间编号", type: "text", width: 100 },
            { name: "建筑面积", type: "text", width: 100 },
            { name: "客户名称", type: "text", width: 100 },
            { name: "房屋状态", type: "select", items: type, valueField: "Id", textField: "name" },
            { name: "迁入日期", type: "text", width: 100},
            { name: "迁出日期", type: "text", width: 100},
            { name: "备注", type: "text", sorting: true },
            { type: "control" }
        ]
    });

});