$(function() {
    clients = [{'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'},
       {'管理处':1,'房间编号':'01-1-1-2','内容':'家里水管破裂','发生日期':'2017-09-10','重要等级':1,'类别':'家政','录入人':'小王'}
    ];
    var guanli = [
        {name:'',Id: 0 },
        {name:'新天泽国际',Id: 1 },
        {name:'阳光花园',Id: 2 },
        {name:'紫金',Id: 3 },
        {name:'世纪天城',Id: 4 },
        {name:'岳泰',Id: 5 },
        {name:'千岛人家',Id: 6 },
        {name:'海明饭店',Id: 7 }
    ]
    var type = [
        {name:'',Id:0},
        {name:'1级',Id:1},
        {name:'2级',Id:2},
        {name:'3级',Id:3},
        {name:'4级',Id:4}
    ]
    $("#jsGrid").jsGrid({
        height: "70%",
        width: "100%",
        filtering: true,
        editing: true,
        inserting: true,
        sorting: true,
        paging: true,
        autoload: true,
        pageSize: 15,
        pageButtonCount: 5,
        deleteConfirm: "Do you really want to delete the client?",
        // controller: db,
        data:clients,
        fields: [
            { name: "管理处", type: "select", items: guanli, valueField: "Id", textField: "name" },
            { name: "房间编号", type: "text", width: 100 },
            { name: "内容", type: "text", width: 100 },
            { name: "发生日期", type: "text", width: 100},
            { name: "重要等级", type: "select", items: type, valueField: "Id", textField: "name" },
            { name: "类别", type: "text", width : 100 },
            { name: "录入人", type: "text", width : 100 },            
            { type: "control" }
        ]
    });

});